evoclue commented on 5 Jul 2016
Using the VAE code here, I get this layer summary:
Layer (type)                       Output Shape        Param #     Connected to                     
_________________________________________________________________________________
input_1 (InputLayer)               (16, 784)           0                                            
_________________________________________________________________________________
dense_1 (Dense)                    (16, 128)           100480      input_1[0][0]                    
_________________________________________________________________________________
dense_2 (Dense)                    (16, 2)             258         dense_1[0][0]                    
_________________________________________________________________________________
dense_3 (Dense)                    (16, 2)             258         dense_1[0][0]                    
_________________________________________________________________________________
lambda_1 (Lambda)                  ((16, 2), 2)        0           dense_2[0][0]&dense_3[0][0]                    
_________________________________________________________________________________
dense_4 (Dense)                    ((16, 2), 128)      384         lambda_1[0][0]                   
_________________________________________________________________________________
dense_5 (Dense)                    ((16, 2), 784)      101136      dense_4[0][0]                    
_________________________________________________________________________________
Total params: 202516
My question is why does the lambda_1 shape change to ((16, 2), 2) instead of staying (16, 2)? Also, how can I properly use the Flatten/Reshape layer to change it to (16,2)? When I try to Flatten the lambda_1 node I get Exception: Input 0 is incompatible with layer flatten_2: expected ndim >= 3, found ndim=2. I feel like flatten wouldn't make sense as there really are only 2 neurons per minibatch unit (or 32 neurons per minibatch). The reason I want to change the shape is because I want to merge layers with another VAE, but I can't merge ((16, 2), 2) with something like (16, 2).