turfaa commented on 7 Mar 2019
I am building a model with this summary.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 10)           0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 10, 300)      1085700     input_1[0][0]                    
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 10, 300)      1085700     input_2[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 10, 300, 1)   0           embedding[0][0]                  
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 10, 300, 1)   0           embedding_1[0][0]                
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 9, 1, 64)     38464       reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 8, 1, 64)     57664       reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 1, 64)     76864       reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 9, 1, 64)     38464       reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 1, 64)     57664       reshape_1[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 1, 64)     76864       reshape_1[0][0]                  
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 1, 1, 64)     0           conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1, 64)     0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 1, 1, 64)     0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 1, 1, 64)     0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 1, 1, 64)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 1, 1, 64)     0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3, 1, 64)     0           max_pooling2d[0][0]              
                                                                 max_pooling2d_1[0][0]            
                                                                 max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 3, 1, 64)     0           max_pooling2d_3[0][0]            
                                                                 max_pooling2d_4[0][0]            
                                                                 max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 192)          0           concatenate[0][0]                
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 192)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 16)           3088        flatten[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           3088        flatten_1[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32)           0           dense[0][0]                      
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           2112        concatenate_2[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 64)           0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 32)           2080        dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 32)           0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           528         dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 32)           544         dense_4[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 32)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 8)            264         dropout_2[0][0]                  
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 2)            18          dense_6[0][0]                    
==================================================================================================
Total params: 2,529,106
Trainable params: 357,706
Non-trainable params: 2,171,400
__________________________________________________________________________________________________
But when I try to start learning, it only prints "Epochs 1/10", nothing more, and it doesn't start learning. I waited for more than half an hour and it doesn't change.
At first, I suspected that it's because my training data is too big. I tried to make it small (100 instances) but nothing changed.
Here is the notebook: https://github.com/tugas-akhir-nlp/coreference-resolution-cnn-v2/blob/master/coreference%20classifier%20training.ipynb
Thanks for the help.