aurum408 commented on 28 Dec 2016 •
edited
Hi
i'm having a problem with using model.save or load_model. i ran this script using theano backend on mac os x 10.11.6
import os
os.environ["KERAS_BACKEND"] = "theano"

from keras.models import Sequential, Model, load_model
from keras.layers import Convolution2D
from keras.layers import Dense, Dropout,Flatten,BatchNormalization,Reshape,Input, Activation,UpSampling2D
from keras.optimizers import *
from keras.datasets import mnist
from theano import tensor as T
import matplotlib.pyplot as plt
import numpy as np

g_opt = Adam(lr=1e-4)
noise_W = 4
noise_H = 4
BATCH_SIZE = 200
def build_gen1():

    inp_g = Input(shape=[noise_W*noise_H])

    #g = Dense(14, activation='relu')(inp_g)
    g = Dense(256 * 14 * 14)(inp_g)
    g = BatchNormalization(mode=2)(g)
    g = Activation('relu')(g)
    g = Reshape([256,14,14])(g)
    g = UpSampling2D(dim_ordering='th')(g)
    g = Convolution2D(123,3,3,border_mode='same',dim_ordering='th')(g)
    g = BatchNormalization(mode=2)(g)
    g = Activation('relu')(g)
    g = Convolution2D(61,3,3,border_mode='same',dim_ordering='th')(g)
    g = BatchNormalization(mode=2)(g)
    g = Activation('relu')(g)
    g_out = Convolution2D(1,1,1,activation='sigmoid',border_mode='same',dim_ordering='th')(g)

    return Model(inp_g, g_out)

gen = build_gen1()
gen.compile(loss='binary_crossentropy', optimizer=g_opt)
gen.summary()
gen.save("ex_gen.h5")

load_gen = load_model("/Users/anastasia/PycharmProjects/pro/ex_gen.h5")
load_gen.summary()
this is what returns gen.summary():
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 16)            0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 50176)         852992      input_2[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 50176)         200704      dense_3[0][0]                    
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 50176)         0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 256, 14, 14)   0           activation_1[0][0]               
____________________________________________________________________________________________________
upsampling2d_1 (UpSampling2D)    (None, 256, 28, 28)   0           reshape_1[0][0]                  
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 123, 28, 28)   283515      upsampling2d_1[0][0]             
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 123, 28, 28)   112         convolution2d_5[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 123, 28, 28)   0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 61, 28, 28)    67588       activation_2[0][0]               
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 61, 28, 28)    112         convolution2d_6[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 61, 28, 28)    0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 1, 28, 28)     62          activation_3[0][0]               
====================================================================================================
Total params: 1,405,085
Trainable params: 1,304,621
Non-trainable params: 100,464
and this is ex_gen summary
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 16)            0                                            
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 50176)         852992      input_2[0][0]                    
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 50176)         200704      dense_3[0][0]                    
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 50176)         0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 256, 14, 14)   0           activation_1[0][0]               
____________________________________________________________________________________________________
upsampling2d_1 (UpSampling2D)    (None, 512, 28, 14)   0           reshape_1[0][0]                  
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 123, 28, 14)   283515      upsampling2d_1[0][0]             
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 123, 28, 14)   112         convolution2d_5[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 123, 28, 14)   0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 61, 28, 14)    67588       activation_2[0][0]               
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 61, 28, 14)    112         convolution2d_6[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 61, 28, 14)    0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 1, 28, 14)     62          activation_3[0][0]               
====================================================================================================
Total params: 1,405,085
Trainable params: 1,304,621
Non-trainable params: 100,464
____________________________________________________________________________________________________
it looks like model was saved with tensorflow backend instead of theano
Thanks