mrgloom commented on 26 Nov 2018
Keras : 2.1.6
Tensorflow : 1.5.0
When I trying to use mobilenet inputing some intermideate tensor with size (128,128,3) and using weights='imagenet'
    mobilenet = MobileNet(input_tensor=warped_image,
                          input_shape=(config.IMAGE_H, config.IMAGE_W, config.N_CHANNELS),
                          alpha=1.0,
                          depth_multiplier=1,
                          include_top=False,
                          weights='imagenet'
                          )
I get an error:
  File "/usr/local/lib/python3.6/site-packages/keras/applications/mobilenet.py", line 333, in MobileNet
    model.load_weights(weights_path)
  File "/usr/local/lib/python3.6/site-packages/keras/engine/topology.py", line 2667, in load_weights
    f, self.layers, reshape=reshape)
  File "/usr/local/lib/python3.6/site-packages/keras/engine/topology.py", line 3365, in load_weights_from_hdf5_group
    str(len(filtered_layers)) + ' layers.')
ValueError: You are trying to load a weight file containing 54 layers into a model with 59 layers.
When weights=None it looks ok:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 3)  0
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 3)    0           input_1[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 32)   896         max_pooling2d_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 32)   0           conv2d_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 32)   9248        max_pooling2d_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 32)   0           conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 16, 16, 64)   18496       max_pooling2d_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 8, 8, 64)     0           conv2d_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 8, 64)     36928       max_pooling2d_4[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 4096)         0           conv2d_4[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 4096)         0           flatten_1[0][0]
__________________________________________________________________________________________________
affine_transform (Dense)        (None, 6)            24582       dropout_1[0][0]
__________________________________________________________________________________________________
bilinear_interpolation_1 (Bilin (None, 128, 128, 3)  0           input_1[0][0]
                                                                 affine_transform[0][0]
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 130, 130, 3)  0           bilinear_interpolation_1[0][0]
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 64, 64, 32)   864         conv1_pad[0][0]
__________________________________________________________________________________________________
conv1_bn (BatchNormalization)   (None, 64, 64, 32)   128         conv1[0][0]
__________________________________________________________________________________________________
conv1_relu (Activation)         (None, 64, 64, 32)   0           conv1_bn[0][0]
__________________________________________________________________________________________________
conv_pad_1 (ZeroPadding2D)      (None, 66, 66, 32)   0           conv1_relu[0][0]
__________________________________________________________________________________________________
conv_dw_1 (DepthwiseConv2D)     (None, 64, 64, 32)   288         conv_pad_1[0][0]
__________________________________________________________________________________________________
conv_dw_1_bn (BatchNormalizatio (None, 64, 64, 32)   128         conv_dw_1[0][0]
__________________________________________________________________________________________________
conv_dw_1_relu (Activation)     (None, 64, 64, 32)   0           conv_dw_1_bn[0][0]
__________________________________________________________________________________________________
conv_pw_1 (Conv2D)              (None, 64, 64, 64)   2048        conv_dw_1_relu[0][0]
__________________________________________________________________________________________________
conv_pw_1_bn (BatchNormalizatio (None, 64, 64, 64)   256         conv_pw_1[0][0]
__________________________________________________________________________________________________
conv_pw_1_relu (Activation)     (None, 64, 64, 64)   0           conv_pw_1_bn[0][0]
__________________________________________________________________________________________________
conv_pad_2 (ZeroPadding2D)      (None, 66, 66, 64)   0           conv_pw_1_relu[0][0]
__________________________________________________________________________________________________
conv_dw_2 (DepthwiseConv2D)     (None, 32, 32, 64)   576         conv_pad_2[0][0]
__________________________________________________________________________________________________
conv_dw_2_bn (BatchNormalizatio (None, 32, 32, 64)   256         conv_dw_2[0][0]
__________________________________________________________________________________________________
conv_dw_2_relu (Activation)     (None, 32, 32, 64)   0           conv_dw_2_bn[0][0]
__________________________________________________________________________________________________
conv_pw_2 (Conv2D)              (None, 32, 32, 128)  8192        conv_dw_2_relu[0][0]
__________________________________________________________________________________________________
conv_pw_2_bn (BatchNormalizatio (None, 32, 32, 128)  512         conv_pw_2[0][0]
__________________________________________________________________________________________________
conv_pw_2_relu (Activation)     (None, 32, 32, 128)  0           conv_pw_2_bn[0][0]
__________________________________________________________________________________________________
conv_pad_3 (ZeroPadding2D)      (None, 34, 34, 128)  0           conv_pw_2_relu[0][0]
__________________________________________________________________________________________________
conv_dw_3 (DepthwiseConv2D)     (None, 32, 32, 128)  1152        conv_pad_3[0][0]
__________________________________________________________________________________________________
conv_dw_3_bn (BatchNormalizatio (None, 32, 32, 128)  512         conv_dw_3[0][0]
__________________________________________________________________________________________________
conv_dw_3_relu (Activation)     (None, 32, 32, 128)  0           conv_dw_3_bn[0][0]
__________________________________________________________________________________________________
conv_pw_3 (Conv2D)              (None, 32, 32, 128)  16384       conv_dw_3_relu[0][0]
__________________________________________________________________________________________________
conv_pw_3_bn (BatchNormalizatio (None, 32, 32, 128)  512         conv_pw_3[0][0]
__________________________________________________________________________________________________
conv_pw_3_relu (Activation)     (None, 32, 32, 128)  0           conv_pw_3_bn[0][0]
__________________________________________________________________________________________________
conv_pad_4 (ZeroPadding2D)      (None, 34, 34, 128)  0           conv_pw_3_relu[0][0]
__________________________________________________________________________________________________
conv_dw_4 (DepthwiseConv2D)     (None, 16, 16, 128)  1152        conv_pad_4[0][0]
__________________________________________________________________________________________________
conv_dw_4_bn (BatchNormalizatio (None, 16, 16, 128)  512         conv_dw_4[0][0]
__________________________________________________________________________________________________
conv_dw_4_relu (Activation)     (None, 16, 16, 128)  0           conv_dw_4_bn[0][0]
__________________________________________________________________________________________________
conv_pw_4 (Conv2D)              (None, 16, 16, 256)  32768       conv_dw_4_relu[0][0]
__________________________________________________________________________________________________
conv_pw_4_bn (BatchNormalizatio (None, 16, 16, 256)  1024        conv_pw_4[0][0]
__________________________________________________________________________________________________
conv_pw_4_relu (Activation)     (None, 16, 16, 256)  0           conv_pw_4_bn[0][0]
__________________________________________________________________________________________________
conv_pad_5 (ZeroPadding2D)      (None, 18, 18, 256)  0           conv_pw_4_relu[0][0]
__________________________________________________________________________________________________
conv_dw_5 (DepthwiseConv2D)     (None, 16, 16, 256)  2304        conv_pad_5[0][0]
__________________________________________________________________________________________________
conv_dw_5_bn (BatchNormalizatio (None, 16, 16, 256)  1024        conv_dw_5[0][0]
__________________________________________________________________________________________________
conv_dw_5_relu (Activation)     (None, 16, 16, 256)  0           conv_dw_5_bn[0][0]
__________________________________________________________________________________________________
conv_pw_5 (Conv2D)              (None, 16, 16, 256)  65536       conv_dw_5_relu[0][0]
__________________________________________________________________________________________________
conv_pw_5_bn (BatchNormalizatio (None, 16, 16, 256)  1024        conv_pw_5[0][0]
__________________________________________________________________________________________________
conv_pw_5_relu (Activation)     (None, 16, 16, 256)  0           conv_pw_5_bn[0][0]
__________________________________________________________________________________________________
conv_pad_6 (ZeroPadding2D)      (None, 18, 18, 256)  0           conv_pw_5_relu[0][0]
__________________________________________________________________________________________________
conv_dw_6 (DepthwiseConv2D)     (None, 8, 8, 256)    2304        conv_pad_6[0][0]
__________________________________________________________________________________________________
conv_dw_6_bn (BatchNormalizatio (None, 8, 8, 256)    1024        conv_dw_6[0][0]
__________________________________________________________________________________________________
conv_dw_6_relu (Activation)     (None, 8, 8, 256)    0           conv_dw_6_bn[0][0]
__________________________________________________________________________________________________
conv_pw_6 (Conv2D)              (None, 8, 8, 512)    131072      conv_dw_6_relu[0][0]
__________________________________________________________________________________________________
conv_pw_6_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_pw_6[0][0]
__________________________________________________________________________________________________
conv_pw_6_relu (Activation)     (None, 8, 8, 512)    0           conv_pw_6_bn[0][0]
__________________________________________________________________________________________________
conv_pad_7 (ZeroPadding2D)      (None, 10, 10, 512)  0           conv_pw_6_relu[0][0]
__________________________________________________________________________________________________
conv_dw_7 (DepthwiseConv2D)     (None, 8, 8, 512)    4608        conv_pad_7[0][0]
__________________________________________________________________________________________________
conv_dw_7_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_dw_7[0][0]
__________________________________________________________________________________________________
conv_dw_7_relu (Activation)     (None, 8, 8, 512)    0           conv_dw_7_bn[0][0]
__________________________________________________________________________________________________
conv_pw_7 (Conv2D)              (None, 8, 8, 512)    262144      conv_dw_7_relu[0][0]
__________________________________________________________________________________________________
conv_pw_7_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_pw_7[0][0]
__________________________________________________________________________________________________
conv_pw_7_relu (Activation)     (None, 8, 8, 512)    0           conv_pw_7_bn[0][0]
__________________________________________________________________________________________________
conv_pad_8 (ZeroPadding2D)      (None, 10, 10, 512)  0           conv_pw_7_relu[0][0]
__________________________________________________________________________________________________
conv_dw_8 (DepthwiseConv2D)     (None, 8, 8, 512)    4608        conv_pad_8[0][0]
__________________________________________________________________________________________________
conv_dw_8_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_dw_8[0][0]
__________________________________________________________________________________________________
conv_dw_8_relu (Activation)     (None, 8, 8, 512)    0           conv_dw_8_bn[0][0]
__________________________________________________________________________________________________
conv_pw_8 (Conv2D)              (None, 8, 8, 512)    262144      conv_dw_8_relu[0][0]
__________________________________________________________________________________________________
conv_pw_8_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_pw_8[0][0]
__________________________________________________________________________________________________
conv_pw_8_relu (Activation)     (None, 8, 8, 512)    0           conv_pw_8_bn[0][0]
__________________________________________________________________________________________________
conv_pad_9 (ZeroPadding2D)      (None, 10, 10, 512)  0           conv_pw_8_relu[0][0]
__________________________________________________________________________________________________
conv_dw_9 (DepthwiseConv2D)     (None, 8, 8, 512)    4608        conv_pad_9[0][0]
__________________________________________________________________________________________________
conv_dw_9_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_dw_9[0][0]
__________________________________________________________________________________________________
conv_dw_9_relu (Activation)     (None, 8, 8, 512)    0           conv_dw_9_bn[0][0]
__________________________________________________________________________________________________
conv_pw_9 (Conv2D)              (None, 8, 8, 512)    262144      conv_dw_9_relu[0][0]
__________________________________________________________________________________________________
conv_pw_9_bn (BatchNormalizatio (None, 8, 8, 512)    2048        conv_pw_9[0][0]
__________________________________________________________________________________________________
conv_pw_9_relu (Activation)     (None, 8, 8, 512)    0           conv_pw_9_bn[0][0]
__________________________________________________________________________________________________
conv_pad_10 (ZeroPadding2D)     (None, 10, 10, 512)  0           conv_pw_9_relu[0][0]
__________________________________________________________________________________________________
conv_dw_10 (DepthwiseConv2D)    (None, 8, 8, 512)    4608        conv_pad_10[0][0]
__________________________________________________________________________________________________
conv_dw_10_bn (BatchNormalizati (None, 8, 8, 512)    2048        conv_dw_10[0][0]
__________________________________________________________________________________________________
conv_dw_10_relu (Activation)    (None, 8, 8, 512)    0           conv_dw_10_bn[0][0]
__________________________________________________________________________________________________
conv_pw_10 (Conv2D)             (None, 8, 8, 512)    262144      conv_dw_10_relu[0][0]
__________________________________________________________________________________________________
conv_pw_10_bn (BatchNormalizati (None, 8, 8, 512)    2048        conv_pw_10[0][0]
__________________________________________________________________________________________________
conv_pw_10_relu (Activation)    (None, 8, 8, 512)    0           conv_pw_10_bn[0][0]
__________________________________________________________________________________________________
conv_pad_11 (ZeroPadding2D)     (None, 10, 10, 512)  0           conv_pw_10_relu[0][0]
__________________________________________________________________________________________________
conv_dw_11 (DepthwiseConv2D)    (None, 8, 8, 512)    4608        conv_pad_11[0][0]
__________________________________________________________________________________________________
conv_dw_11_bn (BatchNormalizati (None, 8, 8, 512)    2048        conv_dw_11[0][0]
__________________________________________________________________________________________________
conv_dw_11_relu (Activation)    (None, 8, 8, 512)    0           conv_dw_11_bn[0][0]
__________________________________________________________________________________________________
conv_pw_11 (Conv2D)             (None, 8, 8, 512)    262144      conv_dw_11_relu[0][0]
__________________________________________________________________________________________________
conv_pw_11_bn (BatchNormalizati (None, 8, 8, 512)    2048        conv_pw_11[0][0]
__________________________________________________________________________________________________
conv_pw_11_relu (Activation)    (None, 8, 8, 512)    0           conv_pw_11_bn[0][0]
__________________________________________________________________________________________________
conv_pad_12 (ZeroPadding2D)     (None, 10, 10, 512)  0           conv_pw_11_relu[0][0]
__________________________________________________________________________________________________
conv_dw_12 (DepthwiseConv2D)    (None, 4, 4, 512)    4608        conv_pad_12[0][0]
__________________________________________________________________________________________________
conv_dw_12_bn (BatchNormalizati (None, 4, 4, 512)    2048        conv_dw_12[0][0]
__________________________________________________________________________________________________
conv_dw_12_relu (Activation)    (None, 4, 4, 512)    0           conv_dw_12_bn[0][0]
__________________________________________________________________________________________________
conv_pw_12 (Conv2D)             (None, 4, 4, 1024)   524288      conv_dw_12_relu[0][0]
__________________________________________________________________________________________________
conv_pw_12_bn (BatchNormalizati (None, 4, 4, 1024)   4096        conv_pw_12[0][0]
__________________________________________________________________________________________________
conv_pw_12_relu (Activation)    (None, 4, 4, 1024)   0           conv_pw_12_bn[0][0]
__________________________________________________________________________________________________
conv_pad_13 (ZeroPadding2D)     (None, 6, 6, 1024)   0           conv_pw_12_relu[0][0]
__________________________________________________________________________________________________
conv_dw_13 (DepthwiseConv2D)    (None, 4, 4, 1024)   9216        conv_pad_13[0][0]
__________________________________________________________________________________________________
conv_dw_13_bn (BatchNormalizati (None, 4, 4, 1024)   4096        conv_dw_13[0][0]
__________________________________________________________________________________________________
conv_dw_13_relu (Activation)    (None, 4, 4, 1024)   0           conv_dw_13_bn[0][0]
__________________________________________________________________________________________________
conv_pw_13 (Conv2D)             (None, 4, 4, 1024)   1048576     conv_dw_13_relu[0][0]
__________________________________________________________________________________________________
conv_pw_13_bn (BatchNormalizati (None, 4, 4, 1024)   4096        conv_pw_13[0][0]
__________________________________________________________________________________________________
conv_pw_13_relu (Activation)    (None, 4, 4, 1024)   0           conv_pw_13_bn[0][0]
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 16384)        0           conv_pw_13_relu[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16384)        0           flatten_2[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 156)          2556060     dropout_2[0][0]
__________________________________________________________________________________________________
custom_zero_padding1d_1 (Custom (None, 312)          0           dense_1[0][0]
==================================================================================================
Total params: 5,875,074
Trainable params: 5,853,186
Non-trainable params: 21,888